Revit 2027 API
ImporterIFC.ProcessIFCProject(IFCAnyHandle) Method
 The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ProcessIFCProject(
	IFCAnyHandle ifcProject
)
Public Sub ProcessIFCProject (
	ifcProject As IFCAnyHandle
)
public:
void ProcessIFCProject(
	IFCAnyHandle^ ifcProject
)
member ProcessIFCProject :
        ifcProject : IFCAnyHandle -> unit
Parameters
ifcProject IFCAnyHandle
 The IfcProject containing the entities in the IFC file.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImporterIFC Class
ProcessIFCProject Overload
Autodesk.Revit.DB.IFC Namespace